Revit 2027 API
Rebar.GetLapLength Method
 Gets the lap length that is used for the specified end - 0 for start, 1 for end.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetLapLength(
	int barEnd
)
Public Function GetLapLength (
	barEnd As Integer
) As Double
public:
double GetLapLength(
	int barEnd
)
member GetLapLength :
        barEnd : int -> float
Parameters
barEnd Int32
 The end where the splice is - 0 for start, 1 for end.
Return Value
Double
 Returns the lap length that is used for the specified end - 0 for start, 1 for end.
Exceptions
Exception | Condition
ArgumentException |  There is no splice at the specified end.
ArgumentOutOfRangeException |  barEnd must be 0 or 1.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace